fe32/tutorials/rheoFoam/Cylinder/Oldroyd-BLog/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       49327;
    }
    walls
    {
        type            wall;
        nFaces          344;
        startFace       49407;
    }
    cylinder
    {
        type            wall;
        nFaces          378;
        startFace       49751;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       50129;
    }
    frontAndBack
    {
        type            empty;
        nFaces          49788;
        startFace       50249;
    }
)


// ************************************************************************* //
