fe32/tutorials/rheoFoam/Cylinder/Oldroyd-BLog/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;

surfaceFormat raw;

formatOptions
{
    ensight
    {
        format  ascii;
    }
}

interpolationScheme cellPointFace;

fields
(
   U  
   tau
   
);

sets
(
    axe
    {
        type        face;
        axis        x;

        start       ( 0 0 0.5 );
        end         ( 60 0 0.5 );
    }
);

surfaces
(
    cylinder
    {
        type            patch;
        patches         ( ".*cylinder.*" );
    }
);

